The label type in dimension equality formats.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
  Since:  2017 Subscription Update
 Syntax
  C#
public enum LabelType
  Visual Basic
Public Enumeration LabelType
  Visual C++
public enum class LabelType
 Members
  Member name  |   Description
   NumberOfWitnessLines   |   the number of witness lines of the dimension
   NumberOfSegments   |   the number of segments of the dimension
   LengthOfSegment   |   the length of segment of the dimension
   TotalLength   |   the total length of the dimension
 See Also
  Autodesk.Revit.DB Namespace